In [12]:
# read file and sort by exam1 score

filename = 'students.tsv'
data = []
with open(filename) as file:
    for line in file:
        if not line.strip():
            continue
       
        data.append(line.strip().split('\t'))

def helper_func(row):
    return int(row[3])
        
# sorted(data, key=lambda line: int(line[3]))

# sorted(data, key=helper_func)


sorted(data, key=lambda row: row[2])[:20]

[['Reilly', 'Brandon', 'reillybran', '10', '94', '64'],
 ['Sellers', 'Stephanie', 'sellersstep', '11', '83', '76'],
 ['Martin', 'Paul', 'martinpaul', '15', '11', '12'],
 ['Day', 'Jon', 'dayjon', '15', '55', '71'],
 ['Reed', 'Madeline', 'reedmade', '16', '39', '46'],
 ['Patrick', 'Rachel', 'patrickrach', '16', '20', '80'],
 ['Evans', 'Dawn', 'evansdawn', '18', '59', '45'],
 ['Cortez', 'Patrick', 'cortezpatr', '18', '22', '2'],
 ['Summers', 'Michael', 'summersmich', '18', '95', '63'],
 ['Watson', 'Jessica', 'watsonjess', '2', '44', '50'],
 ['Long', 'Joel', 'longjoel', '20', '50', '3'],
 ['Dominguez', 'Kathryn', 'dominguezkath', '21', '82', '31'],
 ['Johnson', 'Janice', 'johnsonjani', '22', '49', '93'],
 ['Davis', 'Samuel', 'davissamu', '22', '17', '91'],
 ['Monroe', 'Michael', 'monroemich', '23', '92', '34'],
 ['Larson', 'Melissa', 'larsonmeli', '24', '89', '31'],
 ['Smith', 'Christopher', 'smithchri', '25', '11', '68'],
 ['Lee', 'John', 'leejohn', '25', '25', '39'],
 ['Little', 'Brian', 'littlebria', '25', '35', '88'],
 ['Patterson', 'Jennifer', 'pattersonjenn', '26', '98', '97']]

In [14]:
sorted(data, key=lambda row: int(row[3]))[:10]

[['Watson', 'Jessica', 'watsonjess', '2', '44', '50'],
 ['Klein', 'John', 'kleinjohn', '3', '43', '88'],
 ['Smith', 'Rebecca', 'smithrebe', '3', '75', '55'],
 ['Brooks', 'Marcus', 'brooksmarc', '6', '81', '70'],
 ['Perez', 'Kelli', 'perezkell', '6', '22', '3'],
 ['Wade', 'Stephanie', 'wadestep', '9', '69', '31'],
 ['Reilly', 'Brandon', 'reillybran', '10', '94', '64'],
 ['Sellers', 'Stephanie', 'sellersstep', '11', '83', '76'],
 ['Martin', 'Paul', 'martinpaul', '15', '11', '12'],
 ['Day', 'Jon', 'dayjon', '15', '55', '71']]

In [15]:
sorted(data, key=lambda row: int(row[3]), reverse=True)[:10]
# SELECT 
# 	username, 
# 	exam1, 
# 	exam2 
# FROM STUDENTS ORDER BY exam1 DESC LIMIT 10;

[['Terrell', 'Robert', 'terrellrobe', '99', '93', '60'],
 ['Taylor', 'Diana', 'taylordian', '99', '90', '6'],
 ['Frank', 'Jessica', 'frankjess', '95', '87', '92'],
 ['Rodriguez', 'Michelle', 'rodriguezmich', '94', '24', '50'],
 ['Kennedy', 'Lisa', 'kennedylisa', '93', '19', '48'],
 ['Henderson', 'Michelle', 'hendersonmich', '91', '60', '86'],
 ['Ramsey', 'John', 'ramseyjohn', '89', '95', '94'],
 ['Weber', 'Patrick', 'weberpatr', '87', '33', '92'],
 ['Booth', 'Bradley', 'boothbrad', '85', '8', '77'],
 ['Mcclain', 'Glenn', 'mcclainglen', '85', '98', '52']]

In [17]:
def calc_avg(row):
    return sum([int(ele) for ele in row[3:]])/len(row[3:])

sorted(data, key=calc_avg)

[['Perez', 'Kelli', 'perezkell', '6', '22', '3'],
 ['Martin', 'Paul', 'martinpaul', '15', '11', '12'],
 ['Cortez', 'Patrick', 'cortezpatr', '18', '22', '2'],
 ['Bailey', 'Amanda', 'baileyaman', '27', '4', '38'],
 ['Long', 'Joel', 'longjoel', '20', '50', '3'],
 ['Hull', 'Alexandra', 'hullalex', '38', '7', '42'],
 ['Lee', 'John', 'leejohn', '25', '25', '39'],
 ['Oliver', 'Alex', 'oliveralex', '61', '22', '6'],
 ['Mcclain', 'Brandy', 'mcclainbran', '65', '1', '23'],
 ['Garcia', 'Brian', 'garciabria', '37', '53', '3'],
 ['Watson', 'Jessica', 'watsonjess', '2', '44', '50'],
 ['Reed', 'Madeline', 'reedmade', '16', '39', '46'],
 ['Cook', 'Lisa', 'cooklisa', '66', '25', '11'],
 ['Woodard', 'Judy', 'woodardjudy', '47', '43', '13'],
 ['Smith', 'Christopher', 'smithchri', '25', '11', '68'],
 ['Myers', 'Elizabeth', 'myerseliz', '41', '38', '28'],
 ['Lee', 'Michael', 'leemich', '30', '54', '25'],
 ['Wade', 'Stephanie', 'wadestep', '9', '69', '31'],
 ['Bowers', 'Sandra', 'bowerssand', '52', '8', '50'],
 ['Diaz', 'David', 'diazdavi', '52', '40', '20'],
 ['Jones', 'David', 'jonesdavi', '37', '60', '15'],
 ['Walter', 'Linda', 'walterlind', '28', '14', '71'],
 ['Patrick', 'Rachel', 'patrickrach', '16', '20', '80'],
 ['Novak', 'Melissa', 'novakmeli', '77', '3', '38'],
 ['Francis', 'Shawn', 'francisshaw', '37', '55', '26'],
 ['Thompson', 'Charlene', 'thompsonchar', '37', '56', '26'],
 ['Gallegos', 'Eugene', 'gallegoseuge', '34', '9', '76'],
 ['Evans', 'Dawn', 'evansdawn', '18', '59', '45'],
 ['Cox', 'Jerome', 'coxjero', '67', '28', '29'],
 ['Gamble', 'Matthew', 'gamblematt', '48', '50', '26'],
 ['Moran', 'Troy', 'morantroy', '61', '21', '45'],
 ['Davis', 'Samuel', 'davissamu', '22', '17', '91'],
 ['Gibson', 'Edward', 'gibsonedwa', '84', '27', '21'],
 ['Smith', 'Rebecca', 'smithrebe', '3', '75', '55'],
 ['Holden', 'Michael', 'holdenmich', '57', '23', '53'],
 ['Klein', 'John', 'kleinjohn', '3', '43', '88'],
 ['Dominguez', 'Kathryn', 'dominguezkath', '21', '82', '31'],
 ['Luna', 'Carmen', 'lunacarm', '36', '92', '6'],
 ['Olsen', 'Mariah', 'olsenmari', '44', '27', '64'],
 ['Andrews', 'Luis', 'andrewsluis', '43', '92', '3'],
 ['Santana', 'Linda', 'santanalind', '77', '58', '4'],
 ['Day', 'Jon', 'dayjon', '15', '55', '71'],
 ['Key', 'Debra', 'keydebr', '66', '47', '29'],
 ['Larson', 'Melissa', 'larsonmeli', '24', '89', '31'],
 ['Rhodes', 'Andre', 'rhodesandr', '53', '9', '82'],
 ['Carey', 'Kimberly', 'careykimb', '29', '94', '23'],
 ['Little', 'Brian', 'littlebria', '25', '35', '88'],
 ['Monroe', 'Michael', 'monroemich', '23', '92', '34'],
 ['Patton', 'Robert', 'pattonrobe', '78', '53', '20'],
 ['Bowen', 'Katherine', 'bowenkath', '57', '61', '34'],
 ['Oliver', 'Janice', 'oliverjani', '72', '47', '34'],
 ['Schultz', 'Marcus', 'schultzmarc', '59', '29', '67'],
 ['Johnson', 'Wayne', 'johnsonwayn', '66', '31', '58'],
 ['Brooks', 'Marcus', 'brooksmarc', '6', '81', '70'],
 ['Wilkinson', 'Jennifer', 'wilkinsonjenn', '52', '64', '44'],
 ['Kennedy', 'Lisa', 'kennedylisa', '93', '19', '48'],
 ['Bush', 'Alexander', 'bushalex', '82', '54', '25'],
 ['Nelson', 'Angela', 'nelsonange', '33', '63', '66'],
 ['Hensley', 'James', 'hensleyjame', '52', '50', '61'],
 ['Johnson', 'Janice', 'johnsonjani', '22', '49', '93'],
 ['Hill', 'James', 'hilljame', '59', '22', '85'],
 ['Rodriguez', 'Michelle', 'rodriguezmich', '94', '24', '50'],
 ['Hoffman', 'Shannon', 'hoffmanshan', '29', '68', '71'],
 ['Reilly', 'Brandon', 'reillybran', '10', '94', '64'],
 ['Ellis', 'Paige', 'ellispaig', '41', '46', '82'],
 ['Sawyer', 'Wendy', 'sawyerwend', '81', '59', '30'],
 ['Booth', 'Bradley', 'boothbrad', '85', '8', '77'],
 ['Sellers', 'Stephanie', 'sellersstep', '11', '83', '76'],
 ['Vega', 'Nicholas', 'veganich', '64', '12', '95'],
 ['Munoz', 'Mary', 'munozmary', '77', '41', '55'],
 ['Kerr', 'Sarah', 'kerrsara', '82', '27', '65'],
 ['Summers', 'Michael', 'summersmich', '18', '95', '63'],
 ['Fernandez', 'Jonathan', 'fernandezjona', '74', '80', '22'],
 ['Barnes', 'Tammy', 'barnestamm', '54', '53', '71'],
 ['Duncan', 'Andrew', 'duncanandr', '59', '87', '34'],
 ['Lozano', 'Catherine', 'lozanocath', '71', '19', '94'],
 ['Parrish', 'Nathan', 'parrishnath', '47', '92', '45'],
 ['Smith', 'Carol', 'smithcaro', '73', '48', '65'],
 ['Parsons', 'Cassie', 'parsonscass', '61', '62', '65'],
 ['Fleming', 'Carlos', 'flemingcarl', '50', '45', '93'],
 ['Adams', 'Brenda', 'adamsbren', '80', '49', '60'],
 ['Mclean', 'Christopher', 'mcleanchri', '59', '58', '73'],
 ['Baird', 'Alexandra', 'bairdalex', '32', '90', '71'],
 ['Blair', 'Christopher', 'blairchri', '70', '97', '27'],
 ['Melton', 'Brianna', 'meltonbria', '52', '95', '47'],
 ['Taylor', 'Diana', 'taylordian', '99', '90', '6'],
 ['Weber', 'Patrick', 'weberpatr', '87', '33', '92'],
 ['King', 'Austin', 'kingaust', '64', '89', '59'],
 ['Landry', 'Patrick', 'landrypatr', '41', '82', '93'],
 ['Patterson', 'Jennifer', 'pattersonjenn', '26', '98', '97'],
 ['Paul', 'Philip', 'paulphil', '79', '86', '60'],
 ['Graham', 'Vanessa', 'grahamvane', '78', '76', '73'],
 ['Chang', 'Kristen', 'changkris', '78', '55', '94'],
 ['Mcclain', 'Glenn', 'mcclainglen', '85', '98', '52'],
 ['Lewis', 'Michael', 'lewismich', '73', '65', '98'],
 ['Henderson', 'Michelle', 'hendersonmich', '91', '60', '86'],
 ['Ashley', 'Cody', 'ashleycody', '75', '69', '94'],
 ['Terrell', 'Robert', 'terrellrobe', '99', '93', '60'],
 ['Frank', 'Jessica', 'frankjess', '95', '87', '92'],
 ['Ramsey', 'John', 'ramseyjohn', '89', '95', '94']]

In [20]:
def calc_avg(data):
    exam1_total = 0
    exam2_total = 0
    exam3_total = 0
    for row in data:
        exam1_total += int(row[3])
        exam2_total += int(row[4])
        exam3_total += int(row[5])
        
    exam1_avg = exam1_total/len(data)
    exam2_avg = exam2_total/len(data)
    exam3_avg = exam3_total/len(data)
    
    return exam1_avg, exam2_avg, exam3_avg

calc_avg(data)

# SELECT 
# 	avg(exam1) as 'Exam1 Average', 
# 	avg(exam2), 
# 	avg(exam3)
#  FROM students;

(50.01, 51.51, 51.14)

In [23]:
[(row[2], row[3]) for row in data if int(row[3]) > 80]

# SELECT
# 	username, 
# 	exam1
# FROM
# 	students
# WHERE exam1 > 80;

[('sawyerwend', '81'),
 ('boothbrad', '85'),
 ('mcclainglen', '85'),
 ('gibsonedwa', '84'),
 ('terrellrobe', '99'),
 ('rodriguezmich', '94'),
 ('kennedylisa', '93'),
 ('hendersonmich', '91'),
 ('ramseyjohn', '89'),
 ('kerrsara', '82'),
 ('taylordian', '99'),
 ('weberpatr', '87'),
 ('frankjess', '95'),
 ('bushalex', '82')]

In [25]:
[(row[2], row[3]) for row in data if 80 <= int(row[3]) <= 90]

# SELECT
# 	username, 
# 	exam1
# FROM
# 	students
# WHERE exam1 BETWEEN 80 and 90;

[('sawyerwend', '81'),
 ('adamsbren', '80'),
 ('boothbrad', '85'),
 ('mcclainglen', '85'),
 ('gibsonedwa', '84'),
 ('ramseyjohn', '89'),
 ('kerrsara', '82'),
 ('weberpatr', '87'),
 ('bushalex', '82')]

In [31]:

len([True for row in data if int(row[3]) > 80])

14

In [32]:
count = 0
for row in data:
    if int(row[3]) > 80:
        count += 1
        
print(count)
# SELECT
# 	count(exam1)
# FROM
# 	students
# WHERE exam1 > 80;

14

In [35]:
[row for row in data if row[1] == 'Melissa']

# SELECT
# 	*
# FROM
# 	students
# WHERE first_name == 'Melissa'

[['Larson', 'Melissa', 'larsonmeli', '24', '89', '31'],
 ['Novak', 'Melissa', 'novakmeli', '77', '3', '38']]

In [36]:
[row for row in data if row[1] in ['Melissa', 'Stephanie', 'Alex']]

# SELECT
# 	*
# FROM
# 	students
# WHERE first_name IN ('Melissa', 'Stephanie', 'Alex');

[['Larson', 'Melissa', 'larsonmeli', '24', '89', '31'],
 ['Novak', 'Melissa', 'novakmeli', '77', '3', '38'],
 ['Wade', 'Stephanie', 'wadestep', '9', '69', '31'],
 ['Oliver', 'Alex', 'oliveralex', '61', '22', '6'],
 ['Sellers', 'Stephanie', 'sellersstep', '11', '83', '76']]

In [37]:
[row for row in data if row[1].startswith('Alex')]

# SELECT
# 	*
# FROM
# 	students
# WHERE first_name LIKE 'Alex%';

[['Oliver', 'Alex', 'oliveralex', '61', '22', '6'],
 ['Hull', 'Alexandra', 'hullalex', '38', '7', '42'],
 ['Baird', 'Alexandra', 'bairdalex', '32', '90', '71'],
 ['Bush', 'Alexander', 'bushalex', '82', '54', '25']]

In [38]:
[row for row in data if 'ath' in row[1]]

[['Lozano', 'Catherine', 'lozanocath', '71', '19', '94'],
 ['Bowen', 'Katherine', 'bowenkath', '57', '61', '34'],
 ['Parrish', 'Nathan', 'parrishnath', '47', '92', '45'],
 ['Dominguez', 'Kathryn', 'dominguezkath', '21', '82', '31'],
 ['Fernandez', 'Jonathan', 'fernandezjona', '74', '80', '22']]

In [47]:
counts = {}
for row in data:
    exam_score = row[3]
    
    if int(exam_score) not in counts:
        counts[int(exam_score)] = 0
    
    counts[int(exam_score)] += 1

counts = zip(counts.keys(), counts.values())
sorted(counts, key=lambda row: row[1], reverse=True)

# SELECT 
# 	exam1, 
# 	count(exam1) as c  
# FROM 
# 	students 
# GROUP BY exam1 ORDER BY c DESC;

[(52, 5),
 (59, 4),
 (37, 4),
 (77, 3),
 (61, 3),
 (41, 3),
 (25, 3),
 (66, 3),
 (78, 3),
 (18, 3),
 (64, 2),
 (85, 2),
 (29, 2),
 (16, 2),
 (3, 2),
 (6, 2),
 (57, 2),
 (47, 2),
 (73, 2),
 (99, 2),
 (22, 2),
 (15, 2),
 (82, 2),
 (24, 1),
 (81, 1),
 (80, 1),
 (34, 1),
 (79, 1),
 (72, 1),
 (71, 1),
 (30, 1),
 (84, 1),
 (50, 1),
 (28, 1),
 (27, 1),
 (21, 1),
 (94, 1),
 (93, 1),
 (91, 1),
 (67, 1),
 (53, 1),
 (89, 1),
 (9, 1),
 (20, 1),
 (75, 1),
 (70, 1),
 (10, 1),
 (48, 1),
 (87, 1),
 (38, 1),
 (95, 1),
 (32, 1),
 (36, 1),
 (43, 1),
 (2, 1),
 (54, 1),
 (33, 1),
 (26, 1),
 (23, 1),
 (65, 1),
 (11, 1),
 (44, 1),
 (74, 1)]

In [51]:
counts = {}
for row in data:
    first_name = row[1]
    
    if first_name not in counts:
        counts[first_name] = 0
    
    counts[first_name] += 1

counts = zip(counts.keys(), counts.values())
sorted(counts, key=lambda row: row[1], reverse=True)

# SELECT 
# 	first_name, 
# 	count(first_name) as name_count  
# FROM students
# GROUP BY first_name ORDER BY name_count DESC;

[('Michael', 5),
 ('John', 3),
 ('Christopher', 3),
 ('Patrick', 3),
 ('Melissa', 2),
 ('Marcus', 2),
 ('Janice', 2),
 ('David', 2),
 ('Linda', 2),
 ('Robert', 2),
 ('Jennifer', 2),
 ('Michelle', 2),
 ('Lisa', 2),
 ('James', 2),
 ('Stephanie', 2),
 ('Alexandra', 2),
 ('Jessica', 2),
 ('Brian', 2),
 ('Wendy', 1),
 ('Nicholas', 1),
 ('Brenda', 1),
 ('Charlene', 1),
 ('Bradley', 1),
 ('Eugene', 1),
 ('Mary', 1),
 ('Kimberly', 1),
 ('Philip', 1),
 ('Madeline', 1),
 ('Cassie', 1),
 ('Glenn', 1),
 ('Catherine', 1),
 ('Elizabeth', 1),
 ('Katherine', 1),
 ('Edward', 1),
 ('Debra', 1),
 ('Carlos', 1),
 ('Nathan', 1),
 ('Amanda', 1),
 ('Kathryn', 1),
 ('Paige', 1),
 ('Jerome', 1),
 ('Andre', 1),
 ('Paul', 1),
 ('Kelli', 1),
 ('Troy', 1),
 ('Sarah', 1),
 ('Rebecca', 1),
 ('Joel', 1),
 ('Cody', 1),
 ('Rachel', 1),
 ('Alex', 1),
 ('Shannon', 1),
 ('Vanessa', 1),
 ('Diana', 1),
 ('Brandon', 1),
 ('Matthew', 1),
 ('Judy', 1),
 ('Samuel', 1),
 ('Carmen', 1),
 ('Luis', 1),
 ('Dawn', 1),
 ('Tammy', 1),
 ('Angela', 1),
 ('Austin', 1),
 ('Carol', 1),
 ('Shawn', 1),
 ('Kristen', 1),
 ('Brandy', 1),
 ('Mariah', 1),
 ('Brianna', 1),
 ('Jon', 1),
 ('Wayne', 1),
 ('Andrew', 1),
 ('Alexander', 1),
 ('Sandra', 1),
 ('Jonathan', 1)]